Repository: Punvireakroth/Cashew
Catalog: lib/l10n/app_*.arb
Languages: km

source: Settings
km: ការកំណត់

# settingsAndCustomization
source: Settings & Customization
km: ការកំណត់ និងការប្ដូរតាមបំណង

source: Theme
km: រចនាប័ទ្ម

source: Accent Color
km: ពណ៌សំខាន់

# accentColorDescription
source: Select a color theme for the interface
km: ជ្រើសរើសពណ៌សម្រាប់ចំណុចប្រទាក់

source: Select Accent Color
km: ជ្រើសរើសពណ៌សំខាន់

source: Preferences
km: ចំណូលចិត្ត

source: Language
km: ភាសា

# languageDescription
source: Choose your preferred language
km: ជ្រើសរើសភាសាដែលអ្នកចូលចិត្ត

source: Select Language
km: ជ្រើសរើសភាសា

# systemLanguage
source: System
km: ប្រព័ន្ធ

source: Home
km: ទំព័រដើម

source: Transactions
km: ប្រតិបត្តិការ

source: Budgets
km: ថវិកា

source: More
km: ច្រើនទៀត

source: Save
km: រក្សាទុក

source: Cancel
km: បោះបង់

source: Delete
km: លុប

source: Edit
km: កែសម្រួល

source: Add
km: បន្ថែម

source: Done
km: រួចរាល់

source: Confirm
km: បញ្ជាក់

source: Retry
km: ព្យាយាមម្ដងទៀត

source: Reset
km: កំណត់ឡើងវិញ

source: Action
km: សកម្មភាព

source: Restore
km: ស្ដារឡើងវិញ

source: Archive
km: ទុកក្នុងប័ណ្ណសារ

source: Renew
km: បន្តថ្មី

source: Income
km: ចំណូល

source: Expense
km: ចំណាយ

source: Balance
km: សមតុល្យ

source: Total
km: សរុប

source: All
km: ទាំងអស់

# noTransactions
source: No transactions yet
km: មិនទាន់មានប្រតិបត្តិការ

# noBudgets
source: No budgets yet
km: មិនទាន់មានថវិកា

# noAccounts
source: No accounts yet
km: មិនទាន់មានគណនី

source: Account
km: គណនី

source: Accounts
km: គណនី​នានា

source: Category
km: ប្រភេទ

source: Categories
km: ប្រភេទ​នានា

source: Budget
km: ថវិកា

source: Amount
km: ចំនួនប្រាក់

source: Date
km: កាលបរិច្ឆេទ

source: Notes
km: កំណត់ចំណាំ

source: Title
km: ចំណងជើង

source: What's up
km: សួស្តី

source: Total Balance
km: សមតុល្យសរុប

source: Friend
km: មិត្តភ័ក្ត្រ

source: Add Account
km: បន្ថែមគណនី

# transactionsCount
source: {count} transactions
km: {count} ប្រតិបត្តិការ

# setUpBudget
source: Set up a budget
km: បង្កើតថវិកា

# trackSpendingHabits
source: Track your spending habits
km: តាមដានទម្លាប់ការចំណាយរបស់អ្នក

source: All Accounts
km: គណនីទាំងអស់

source: Specific Account
km: គណនីជាក់លាក់

# categoryCount
source: {count} {count, plural, =1{category} other{categories}}
km: {count} ប្រភេទ

# leftOf
source: left of {amount}
km: នៅសល់ពី {amount}

source: Today
km: ថ្ងៃនេះ

source: Yesterday
km: ម្សិលមិញ

# budgetExpired
source: "{name}" has expired
km: "{name}" បានផុតកំណត់

# budgetsExpired
source: {count} budgets have expired
km: {count} ថវិកាបានផុតកំណត់

# renewOrArchive
source: Renew or archive to keep things tidy
km: បន្តថ្មី ឬទុកក្នុងប័ណ្ណសារ

source: Expired
km: ផុតកំណត់

source: Spent
km: បានចំណាយ

source: Over by
km: លើសដោយ

source: Saved
km: បានសន្សំ

source: Budget archived
km: ថវិកាបានទុកក្នុងប័ណ្ណសារ

# budgetRenewed
source: Budget renewed for new period
km: ថវិកាបានបន្តថ្មីសម្រាប់រយៈពេលថ្មី

source: New period
km: រយៈពេលថ្មី

# overBudgetBy
source: Over budget by {amount}
km: លើសថវិកាដោយ {amount}

source: Budget period ended
km: រយៈពេលថវិកាបានបញ្ចប់

# dailySpendingAllowance
source: You can spend {amount}/day for {days} more days
km: អ្នកអាចចំណាយ {amount}/ថ្ងៃ សម្រាប់ {days} ថ្ងៃទៀត

# moreBudgets
source: +{count} more {count, plural, =1{budget} other{budgets}}
km: +{count} ថវិកាទៀត

source: See all transactions
km: មើលប្រតិបត្តិការទាំងអស់

source: Spending Overview
km: ទិដ្ឋភាពទូទៅនៃការចំណាយ

# noSpendingData
source: No spending data yet
km: មិនទាន់មានទិន្នន័យការចំណាយ

# addExpenseToSeeTrends
source: Add expense transactions to see trends
km: បន្ថែមប្រតិបត្តិការចំណាយដើម្បីមើលនិន្នាការ

source: Search transactions...
km: ស្វែងរកប្រតិបត្តិការ...

source: Filter Transactions
km: តម្រងប្រតិបត្តិការ

source: Transaction Type
km: ប្រភេទប្រតិបត្តិការ

source: No categories available
km: មិនមានប្រភេទ

source: Apply Filters
km: អនុវត្តតម្រង

source: Error loading transactions
km: កំហុសក្នុងការផ្ទុកប្រតិបត្តិការ

source: No transactions found
km: រកមិនឃើញប្រតិបត្តិការ

# noTransactionsFor
source: No transactions for {month}
km: គ្មានប្រតិបត្តិការសម្រាប់ {month}

source: Add Transaction
km: បន្ថែមប្រតិបត្តិការ

source: Active
km: សកម្ម

source: Archived
km: ប័ណ្ណសារ

# createBudgetPrompt
source: Create a budget to start tracking your spending habits
km: បង្កើតថវិកាដើម្បីចាប់ផ្តើមតាមដាន ទម្លាប់ការចំណាយរបស់អ្នក

source: Create Budget
km: បង្កើតថវិកា

source: No archived budgets
km: គ្មានថវិកាក្នុងប័ណ្ណសារ

# archivedBudgetsHint
source: Completed or expired budgets will appear here after archiving
km: ថវិកាដែលបានបញ្ចប់ ឬផុតកំណត់ នឹងបង្ហាញនៅទីនេះបន្ទាប់ពីទុកក្នុងប័ណ្ណសារ

source: Expired Budgets
km: ថវិកាផុតកំណត់

# renewOrArchiveBudgets
source: Renew or archive these budgets
km: បន្តថ្មី ឬទុកក្នុងប័ណ្ណសារថវិកាទាំងនេះ

source: Upcoming Budgets
km: ថវិកានាពេលខាងមុខ

source: Archive Budget
km: ទុកថវិកាក្នុងប័ណ្ណសារ

# archiveConfirmMessage
source: Archive "{name}"? You can restore it later from the Archived tab.
km: ទុក "{name}" ក្នុងប័ណ្ណសារ? អ្នកអាចស្ដារវាឡើងវិញពីផ្ទាំងប័ណ្ណសារ។

# budgetArchivedMessage
source: {name} archived
km: {name} បានទុកក្នុងប័ណ្ណសារ

# budgetRestored
source: {name} restored
km: {name} បានស្ដារឡើងវិញ

source: Edit Budget
km: កែសម្រួលថវិកា

source: Delete Budget
km: លុបថវិកា

# deleteConfirmMessage
source: Are you sure you want to delete "{name}"? This cannot be undone.
km: តើអ្នកប្រាកដថាចង់លុប "{name}"? សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។

source: Renew Budget
km: បន្តថវិកាថ្មី

# renewBudgetPrompt
source: Create a new "{name}" budget for the next period?
km: បង្កើតថវិកា "{name}" ថ្មីសម្រាប់រយៈពេលបន្ទាប់?

source: Limit
km: កំណត់

# budgetRenewedSuccess
source: Budget renewed successfully
km: ថវិកាបានបន្តថ្មីដោយជោគជ័យ
